<details ><summary>apply for staging 2025-03-30 02:50:51 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #5
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_policy.read_only_ecr_access will be created
  + resource "aws_iam_policy" "read_only_ecr_access" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "read-only-ecr-access-renamed"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ecr-access-2 will be created
  + resource "aws_iam_role" "ecr-access-2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecr.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr-access-2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecr_access will be created
  + resource "aws_iam_role" "ecr_access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecr.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr-access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr_access_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecr_access_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecr-access"
    }

  # aws_s3_bucket.terraform_state will be created
  + resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-wine-support-terraform"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_versioning.terraform_state_versioning will be created
  + resource "aws_s3_bucket_versioning" "terraform_state_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
aws_iam_policy.read_only_ecr_access: Creating...
aws_iam_role.ecr_access: Creating...
aws_iam_role.ecr-access-2: Creating...
aws_s3_bucket.terraform_state: Creating...
aws_iam_role.ecr_access: Creation complete after 0s [id=ecr-access]
aws_iam_policy.read_only_ecr_access: Creation complete after 0s [id=arn:aws:iam::544690439995:policy/read-only-ecr-access-renamed]
aws_iam_role_policy_attachment.ecr_access_attachment: Creating...
aws_iam_role.ecr-access-2: Creation complete after 0s [id=ecr-access-2]
aws_iam_role_policy_attachment.ecr_access_attachment: Creation complete after 1s [id=ecr-access-20250330025107480900000001]
aws_s3_bucket.terraform_state: Creation complete after 4s [id=staging-wine-support-terraform]
aws_s3_bucket_versioning.terraform_state_versioning: Creating...
aws_s3_bucket_versioning.terraform_state_versioning: Creation complete after 3s [id=staging-wine-support-terraform]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```
</details>

</details>